Revit 2027 API
Toposolid.SketchId Property
 Returns id of the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SketchId { get; }
Public ReadOnly Property SketchId As ElementId
	Get
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
member SketchId : ElementId with get
Property Value
ElementId
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace